# Домашнее задание 1 (5 баллов).

Все задания ниже имеют равный вес (5/16).

In [1]:
import pandas as pd

#### Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

### Одно из важных достоинств pandas $-$ это удобные методы реляционного взаимодействия с данными, аналогичные, например, возможностям SQL для слияния и конкатенации таблиц: merge, join, concat. Наличие готовых методов позволяет не реализовывать самостоятельно поэлементную обработку данных и оперировать сразу целыми таблицами данных.

Подробно об этих методах посмотрите тут: https://www.kaggle.com/residentmario/renaming-and-combining#Combining

##### Задание 1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [2]:
info = 'Students_info_'
marks = 'Students_marks_'
info_df = []
info_paths = []
marks_df = []
marks_paths = []

def create_df(names_df, paths, base=info):
    dfs = {}
    for i in range(10):
        names_df.append(f'{base}{i}_df')
        paths.append(f'Data/{base}{i}.csv')
        
    for name, file in zip(names_df, paths):
        dfs[name] = pd.read_csv(file)
    
    return dfs
    

info_dfs = dict(create_df(info_df, info_paths, base=info))
marks_dfs = dict(create_df(marks_df, marks_paths, base=marks))

    
left = pd.concat(info_dfs.values())
right = pd.concat(marks_dfs.values())
df = pd.merge(left, right, on='index')
df

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,1,female,group C,some college,standard,completed,group1,69,90,88
2,2,female,group B,master's degree,standard,none,group1,90,95,93
3,3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,4,male,group C,some college,standard,none,group1,76,78,75
...,...,...,...,...,...,...,...,...,...,...
995,995,female,group E,master's degree,standard,completed,group10,88,99,95
996,996,male,group C,high school,free/reduced,none,group10,62,55,55
997,997,female,group C,high school,free/reduced,completed,group10,59,71,65
998,998,female,group D,some college,standard,completed,group10,68,78,77
999,999,female,group D,some college,free/reduced,none,group10,77,86,86

#### Задание 2. Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы.

In [3]:
df.drop('index', inplace=True, axis=1)
df.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
5,female,group B,associate's degree,standard,none,group1,71,83,78
6,female,group B,some college,standard,completed,group1,88,95,92
7,male,group B,some college,free/reduced,none,group1,40,43,39
8,male,group D,high school,free/reduced,completed,group1,64,64,67
9,female,group B,high school,free/reduced,none,group1,38,60,50

#### Задание 3. Выведите на экран размеры полученной таблицы

In [4]:
df.shape

(1000, 9)

#### Задание 4. Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [5]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

#### Задание 5. Проверьте, есть ли в таблице пропущенные значения

In [6]:
df.isnull().values.any()

False

#### Задание 6. Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [7]:
df[['math score', 'reading score', 'writing score']].mean()

math score       66.089
reading score    69.169
writing score    68.054
dtype: float64

**Задание 7. Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.**

In [8]:
df.groupby('test preparation course')[['math score', 'reading score', 'writing score']].mean()

                         math score  reading score  writing score
test preparation course
completed                 69.695531      73.893855      74.418994
none                      64.077882      66.534268      64.504673

**Задание 8. Выведите на экран все различные значения из столбца lunch.**

In [9]:
df['lunch'].unique()

array(['standard', 'free/reduced'], dtype=object)

**Задание 9. Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename**
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [10]:
df.rename(columns={
    'parental level of education': 'education',
    'test preparation course': 'test preparation'
}, inplace=True)

df.head()

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75

**Зафиксируем минимальный балл для сдачи экзамена**

In [11]:
passmark = 50

**Задание 10. Ответьте на вопросы:**
    * Какая доля студентов сдала экзамен по математике (passmark > 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [61]:
# По условию неравенство строгое: passmark > 50, но 50 - минимальный балл для сдачи (т.е. входит в зачет)
# Это противоречие
# Я буду решать по условию passmark >= 50 (50 входит). Это подтверждается задачей 16

# 1
passed_math = (df['math score'] >= 50)
print(f"Доля сдавших математику:\n{passed_math.mean()}\n")

#2
completed_course = (df['test preparation'] == 'completed')

print(f"""Проходили курс, сдали матан: 
{len(df[completed_course & passed_math]) / completed_course.sum():.2f}
""")

#3
female = (df['gender'] == 'female')
no_course = (df['test preparation'] == 'none')

print(f"""Женщины, без курса, не сдали матан: 
{len(df[female & no_course & (df['math score'] < 50)]) / len(df[female & no_course]):.2f}
""")

Доля сдавших математику:
0.865

Проходили курс, сдали матан:
0.92

Женщины, без курса, не сдали матан:
0.21

**Задание 11. С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.**
    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [14]:
#1
print((df.groupby('race/ethnicity')['reading score']).mean())
%timeit (df.groupby('race/ethnicity')['reading score']).mean()

race/ethnicity
group A    64.674157
group B    67.352632
group C    69.103448
group D    70.030534
group E    73.028571
Name: reading score, dtype: float64
1.32 ms ± 7.27 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [15]:
#2
print(df.groupby('education')['writing score'].min())
%timeit (df.groupby('education')['writing score']).min()

education
associate's degree    35
bachelor's degree     38
high school           15
master's degree       46
some college          19
some high school      10
Name: writing score, dtype: int64
1.4 ms ± 182 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

**Задание 12. Выполните задание 11 с помощью циклов. Сравните время выполнения.**

In [18]:
#1
# Итерируемся по рядам
# _2 - это race/ethnicity, _8 - reading score.
# Из-за составных названий pandas автоматически поменял названия

from collections import defaultdict

def loop():
    res = defaultdict(list)
    for row in df.itertuples():
        res[row._2].append(row._8)

    for k, v in res.items():
        res[k] = sum(v) / len(v)
        
    return res
    
    
%timeit loop()
# Видим, что выполняется в 2 раза дольше.

2.88 ms ± 405 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [50]:
#2
# pandas переименовал writing score в _9. 

def loop():
    res = dict()
    for degree in df.education.unique():
        res[degree] = float('inf') # +бесконечность - удобно для подобных сравнений
    
    for row in df.itertuples():
        if row._9 < res[row.education]:
            res[row.education] = row._9
            
    return res


%timeit loop()
# Как и в предыдщем задании, время ~ в 2 раза выше.

3.63 ms ± 411 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

**Задание 13. Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.**

Это можно сделать с помощью сводных таблиц (pivot_table):

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [17]:
# по дефолту aggfunc=np.mean
grouped = pd.pivot_table(df, index=['gender', 'education'])
grouped

                           math score  reading score  writing score
gender education
female associate's degree   65.250000      74.120690      74.000000
       bachelor's degree    68.349206      77.285714      78.380952
       high school          59.351064      68.202128      66.691489
       master's degree      66.500000      76.805556      77.638889
       some college         65.406780      73.550847      74.050847
       some high school     59.296703      69.109890      68.285714
male   associate's degree   70.764151      67.433962      65.405660
       bachelor's degree    70.581818      68.090909      67.654545
       high school          64.705882      61.480392      58.539216
       master's degree      74.826087      73.130435      72.608696
       some college         69.009259      64.990741      63.148148
       some high school     67.840909      64.693182      61.375000

#### Задание 14. Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [63]:
df['Math_PassStatus'] = df['math score'].apply(lambda x: 'F' if x < 50 else 'P')
df['Writing_PassStatus'] = df['writing score'].apply(lambda x: 'F' if x < 50 else 'P')
df['Reading_PassStatus'] = df['reading score'].apply(lambda x: 'F' if x < 50 else 'P')

print(
    f"""\tМатематика\n{df['Math_PassStatus'].value_counts()}\n
\tПисьмо\n{df['Writing_PassStatus'].value_counts()}\n
\tЧтение\n{df['Reading_PassStatus'].value_counts()}"""
)

	Математика
P    865
F    135
Name: Math_PassStatus, dtype: int64

	Письмо
P    886
F    114
Name: Writing_PassStatus, dtype: int64

	Чтение
P    910
F     90
Name: Reading_PassStatus, dtype: int64

#### Задание 15. Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [64]:
from numpy import where

df['OverAll_PassStatus'] = where((df['Math_PassStatus'] == 'P') & (
    df['Writing_PassStatus'] == 'P') & (df['Reading_PassStatus'] == 'P'), 'P', 'F')
df.head()

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score,Math_PassStatus,Writing_PassStatus,Reading_PassStatus,OverAll_PassStatus
0,female,group B,bachelor's degree,standard,none,group1,72,72,74,P,P,P,P
1,female,group C,some college,standard,completed,group1,69,90,88,P,P,P,P
2,female,group B,master's degree,standard,none,group1,90,95,93,P,P,P,P
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44,F,F,P,F
4,male,group C,some college,standard,none,group1,76,78,75,P,P,P,P

In [66]:
# Другой способ, через apply и функцию (не знаю, как решить через безымянную lambda функцию)

def positive_grades(row):
    if 'F' in (row.Math_PassStatus, row.Writing_PassStatus, row.Reading_PassStatus):
        return 'F'
    else:
        return 'P'
    

df['OverAll_PassStatus'] = df.apply(positive_grades, axis=1)
df.head()

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score,Math_PassStatus,Writing_PassStatus,Reading_PassStatus,OverAll_PassStatus
0,female,group B,bachelor's degree,standard,none,group1,72,72,74,P,P,P,P
1,female,group C,some college,standard,completed,group1,69,90,88,P,P,P,P
2,female,group B,master's degree,standard,none,group1,90,95,93,P,P,P,P
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44,F,F,P,F
4,male,group C,some college,standard,none,group1,76,78,75,P,P,P,P

In [67]:
print(f'''Кол-во студентов, сдавших все экзамены:
{(df['OverAll_PassStatus'].values == 'P').sum()}''')

Кол-во студентов, сдавших все экзамены:
812

In [68]:
# Можно вывести всех сдавших студентов другим способом
print(f'''Кол-во студентов, сдавших все экзамены:
{len(df[df['OverAll_PassStatus'] == 'P'])}''')

Кол-во студентов, сдавших все экзамены:
812

#### Задание 16. Переведем баллы в оценки

### Система перевода баллов в оценки
####      [90;100] = A
####      [80;90) = B
####      [70;80) = C
####      [60;70) = D
####      [50;60) = E
####      [0;50) = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

In [83]:
grades = {90: 'A', 80: 'B', 70: 'C', 60: 'D', 50: 'E', 0: 'F'}

def GetGrade(average_mark):
    for score in grades:
        if average_mark >= score:
            return grades[score]
        

mean_score = df.iloc[:, 6:9].mean(axis=1)
df["Grade"] = mean_score.apply(GetGrade)
df['Grade'].value_counts()

C    261
D    256
E    182
B    146
F    103
A     52
Name: Grade, dtype: int64